#Область СлужебныеПроцедурыИФункции

 Функция  ПроцентОтРаботыДляСотрудника(Сотрудник,Дата)  Экспорт 
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL (ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,0) КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПроцентОтРабот = Выборка.ПроцентОтРабот;
	КонецЦикла;
    	
    Возврат ПроцентОтРабот; 
	
КонецФункции
	 
#КонецОбласти
