#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии;
		 
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	
	РассчитатьУдержания(); 
	
 	ВзаиморасчетыССотрудниками();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьУдержания() 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_Удержания.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии * 0.13;
		 
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать(); 		

КонецПроцедуры

Процедура ВзаиморасчетыССотрудниками() 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированныхПремийПремии.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Результат КАК РезультатНачичсления,
		|	ВКМ_Удержания.Результат КАК РезультатУдержания,
		|	ВКМ_НачислениеФиксированныхПремийПремии.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированныхПремий.Премии КАК ВКМ_НачислениеФиксированныхПремийПремии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ПО ВКМ_НачислениеФиксированныхПремийПремии.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
		|			И ВКМ_НачислениеФиксированныхПремийПремии.Ссылка = ВКМ_ДополнительныеНачисления.Регистратор.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_НачислениеФиксированныхПремийПремии.Сотрудник = ВКМ_Удержания.Сотрудник
		|			И ВКМ_НачислениеФиксированныхПремийПремии.Ссылка = ВКМ_Удержания.Регистратор.Ссылка
		|ГДЕ
		|	ВКМ_НачислениеФиксированныхПремийПремии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	
	Пока Выборка.Следующий() Цикл
				
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.РезультатНачичсления - Выборка.РезультатУдержания; 
	
	КонецЦикла;
	
	 Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		

КонецПроцедуры

#КонецОбласти

#КонецЕсли