#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии;
		 
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	
	РассчитатьУдержания(); 
//	
//	ВзаиморасчетыССотрудниками();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьУдержания() 
	
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		
	     Движение = Движения.ВКМ_Удержания.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		 Движение.Результат = ТекСтрокаПремии.РазмерПремии * 0.13;
		 
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать(); 		

КонецПроцедуры
#КонецОбласти

#КонецЕсли