Процедура ОбработкаПроведения(Отказ,Режим)
	
	//СделатьЗапрос!!!!!!!!!!!!!!!!!!
	
	
	Если Договор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Отказ = Истина;
		Сообщить("НЕ верный вид Договора");
	КонецЕсли;
	Если Дата < Договор.ВКМ_НачалоДействияДоговора ИЛИ Дата > Договор.ВКМ_КонецДействияДоговора Тогда
		Отказ = Истина;
		Сообщить("Срок действия выбранного договра на абонентское обслуживание закончился или ещё не начался");
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВыполненныеКлиентуРаботы
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов * Договор.ВКМ_СтоимостьЧасаРаботы;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры