
#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_КонецДействияДоговора КАК КонецДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И
		|		ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка.Вид указанного договора, не является видом договора""Абонентское обслуживание"".",,,,Отказ);
	КонецЕсли;
	Если РезультатЗапроса.Пустой() = Ложь И (Дата < Выборка.НачалоДействияДоговора ИЛИ Дата > Выборка.КонецДействияДоговора) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка.Дата документа не находится в периоде действия данного Договора на абонентское обслуживание",,,,Отказ);
	КонецЕсли;
	
	
	Если Не РезультатЗапроса.Пустой() Тогда
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов * Выборка.СтоимостьЧасаРаботы;
	КонецЦикла;
    КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда  
	Возврат; 
	КонецЕсли;  
	
	Если Не Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Номер,
		|	ВКМ_ОбслуживаниеКлиента.Дата
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		СпециалистЗамена = "";
		ДатаПроведенияРаботЗамена = "";
		ВремяНачалаРаботЗамена = "";
		ВремяОкончанияРаботЗамена = "";
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Специалист <> Специалист Тогда
				СпециалистЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялся специалист.Новый специалист - %1",Специалист,Выборка.Номер,Выборка.Дата); 
			КонецЕсли;	
			Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
				ДатаПроведенияРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялась дата проведения работ.Новая дата проведения работ - %1",Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;"),Выборка.Номер,Выборка.Дата); 
			КонецЕсли;	
			Если Выборка.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
				ВремяНачалаРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялось время начала работ.Новое время начала работ - %1",Формат(ВремяНачалаРабот,"ДЛФ=T"),Выборка.Номер,Выборка.Дата);
			КонецЕсли;			
			Если Выборка.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
				ВремяОкончанияРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялось время окончания работ.Новое время окончания работ - %1",Формат(ВремяОкончанияРабот,"ДЛФ=T"),Выборка.Номер,Выборка.Дата);
			КонецЕсли;				
		КонецЦикла; 
		
		
		 Сообщение = СпециалистЗамена + ДатаПроведенияРаботЗамена + ВремяНачалаРаботЗамена + ВремяОкончанияРаботЗамена; 
		 
		 Если Сообщение <> "" Тогда
		 НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		 НовыйЭлемент.ТекстСообщения = Сообщение;
		 НовыйЭлемент.Записать();

		 КонецЕСли;
		
	КонецЕсли;
	
	// Если документ записывается в первый разв базу	
	
	Если Ссылка.Пустая() Тогда  
		
		 СОобщение = СтрШаблон("Новая заявка на обслуживание от %7 Клиент - %1.Специалист - %2. Дата проведения работ - %3.Время начала работ - %4.Время окончания работ - %5. Описание проблемы - %6",Клиент,Специалист,Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;"),Формат(ВремяНачалаРабот,"ДЛФ=T"),Формат(ВремяОкончанияРабот,"ДЛФ=T"),ОписаниеПроблемы,Дата);  
		
		 НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		 НовыйЭлемент.ТекстСообщения = Сообщение;
		 НовыйЭлемент.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


