
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

    // Имя динамического списка
    ИмяДинамическогоСписка = "Список"; // Укажите имя вашего динамического списка
 
    // Получаем элемент динамического списка

    ДинамическийСписок = Элементы[ИмяДинамическогоСписка];
   
 
    // Добавляем новую колонку
    НовыйЭлемент = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"), ДинамическийСписок);
    НовыйЭлемент.Заголовок = "ВКМ_НачалоДействияДоговора"; // Заголовок колонки
    НовыйЭлемент.ПутьКДанным = ИмяДинамическогоСписка + ".ВКМ_НачалоДействияДоговора"; // Путь к данным

	
	
КонецПроцедуры
