#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сотрудник", Строка.Сотрудник);
		НайденнеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
		ОтпускДней = 0;     
		Для Каждого Стр ИЗ НайденнеСтроки Цикл
			 КоличествоДнейОтпуска = (Стр.ДатаОкончания - Стр.ДатаНачала) / 60 / 60 / 24; 
			 ОтпускДней = ОтпускДней + КоличествоДнейОтпуска; 
		
			 Стр.КоличествоДнейВОтпуске = ОтпускДней; 

		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроанализироватьОтпсука(Команда)
	
	    АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		
		СтрутураПараметров = Новый Структура("АдресТоваровДокумента", АдресТоваровВХранилище);
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтрутураПараметров,ЭтаФорма,); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
 
Функция ПоместитьТоварыВХранилище() 
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(),УникальныйИдентификатор); 
	Возврат Адрес; 
	
КонецФункции

#КонецОбласти


