Функция ВыполнитьАвтозаполнениеМодМенеджера(Период)  Экспорт  
		
	МассивДоговоров = Новый Массив;
	МассивРеализаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДоговорыКонтрагентов.Ссылка КАК Договор,
					|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
					|	ДоговорыКонтрагентов.Владелец.Ссылка КАК Контрагент,
					|	ДоговорыКонтрагентов.Организация КАК Организация
					|ИЗ
					|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
					|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
					|ГДЕ
					|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
					|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &КонецПериода
					|	И ДоговорыКонтрагентов.ВКМ_КонецДействияДоговора >= &НачалоПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Договор);
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
		МассивРеализаций.Добавить(Выборка.Реализация) 
		Иначе		//Если Не ЗначениеЗаполнено(НоваяСтрока.РеализацияТоваровИУслуг)Тогда 
			ДокПриход = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДокПриход.Дата = Период.ДатаОкончания; 
			ДокПриход.Заполнить(Выборка.Договор); 
			ДокПриход.Организация = Выборка.Организация;
			ДокПриход.Контрагент = Выборка.Контрагент;
			ДокПриход.Договор = Выборка.Договор;
			ДокПриход.ВКМ_ВыполнитьАвтозаполнение(Выборка.Контрагент,Выборка.Договор,Период.ДатаОкончания);
			//ДокПриход.Дата = ТекущаяДата();
			//ДокПРиход.Контрагент = Выборка.Контрагент;
			//ДокПРиход.Договор = Выборка.Договор;
			
			ДокПриход.ПроверитьЗаполнение();
			ДокПриход.Записать(РежимЗаписиДокумента.Проведение);
			МассивРеализаций.Добавить(ДокПриход.Ссылка);
		КонецЕсли;		
		
		МассивДоговороИРеализаций = Новый Массив;
		МассивДоговороИРеализаций.Добавить(МассивДоговоров);
		МассивДоговороИРеализаций.Добавить(МассивРеализаций);
		
		
	КонецЦикла;
	
	 Возврат МассивДоговороИРеализаций;
	
	//ДокПриход = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	//ДокПриход.Дата = ТекущаяДата();
	//ДокПриход.Заполнить(Выборка.Договор);
	//	//ДокПриход.Дата = ТекущаяДата();
	//	//ДокПРиход.Контрагент = Выборка.Контрагент;
	//	//ДокПРиход.Договор = Выборка.Договор;
	//ДокПриход.Записать();
	
	
	
	
КонецФункции 