#Область ОбработчикиСобытийФормы
&НаСервере  
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТоваровДокумента); 
	ЗаполнитьГанта(ТаблицаДанных);
	
КонецПроцедуры 
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьГанта(ТаблицаДанных) 
	
	Ганта.Очистить();
	ДЛя каждого строка из ТаблицаДанных Цикл
	Точка = Ганта.УстановитьТочку(СТрока.Сотрудник);
	ТОчка.Текст = СТрока.Сотрудник;
	Серия = Ганта.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	Значение = Ганта.ПолучитьЗначение(Точка,Серия);
	
	Интервал = Значение.Добавить();
	Интервал.Начало = строка.ДатаНачала;
	Интервал.КОнец = строка.ДатаОкончания;
		
		
	КонецЦикла;	
	
	
	
КонецПроцедуры
#КонецОбласти