#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
    СформироватьДвижения(); 
    
    РассчитатьОсновныеНачисления();
	
	РассчитатьДополнительныеНачисления();
	
	РассчитатьОтпуск();
	
    РассчитатьУдержания(Начисления);
    
    ВзаиморасчетыССотрудниками();
    
	ДнейВОтпуске();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
	Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда

		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаКонец;
		Движение.ПериодРегистрации = Дата;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;  
		
		Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаНачала,-12));
		    Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаКонец,-1));
		    Движение.РабочихДней = (ТекСтрокаНачисления.ДатаКонец - ТекСтрокаНачисления.ДатаНачала)/ 86400 + 1;;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда

	     Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		 
	КонецЕсли;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		
		Движение.ПериодРегистрации = Дата;
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления")Тогда 
			Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
			Движение.БазовыйПериодКонец = ТекСтрокаНачисления.ДатаКОнец;
		КонецЕсли;
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления")Тогда 
			Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		КонецЕсли;
		
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
	    Движение.Реквизит = ТекСтрокаНачисления.ВидРасчета;
	    
	КонецЦикла;

	
	Движения.ВКМ_ОсновныеНачисления.Записать();  
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	Движения.ВКМ_Удержания.Записать(); 
	
КонецПроцедуры 

Процедура РассчитатьОсновныеНачисления();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейПериодДействия КАК План,
		|	ЕстьNull(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия,0) КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕстьNull (ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад,0)  КАК Оклад,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник.Ссылка КАК СотрудникСсылка
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник.Ссылка = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Ссылка
		|ГДЕ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Получить(Выборка.НомерСтроки-1);
		Движение.Результат = Выборка.Оклад /Выборка.План * Выборка.Факт;
		Движение.РабочихДней = Выборка.Факт;
		
	КонецЦикла;  
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
		
КонецПроцедуры 

Процедура РассчитатьДополнительныеНачисления();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNull (ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход,0) КАК СуммаКОплатеПриход,
		|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
		|			Сотрудник В
		|			(ВЫБРАТЬ
		|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|			ГДЕ
		|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Получить(Выборка.НомерСтроки-1);
		Движение.Результат = Выборка.СуммаКОплатеПриход;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(,Истина);

		
КонецПроцедуры

 Процедура РассчитатьОтпуск()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ЕстьNull(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза,0) КАК РезультатБаза,
|	ЕстьNull(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза,0) КАК РезультатБаза1,
|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия КАК Факт,
|	ЕстьNull(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РабочихДнейБаза,0) КАК РабочихДней,
|   ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник
|ИЗ
|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
|				&Измерения,
|				&Измерения,
|				,
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
|				&Измерения,
|				&Измерения,
|				,
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки)
|ГДЕ
|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Получить(Выборка.НомерСтроки-1);
		
		Если Выборка.РабочихДней =0 Тогда
		Движение.Результат = 0 
		Иначе
		Движение.Результат = (Выборка.РезультатБаза + Выборка.РезультатБаза1)/Выборка.РабочихДней * Движение.РабочихДней;	
		КОнецЕсли;
					
	КонецЦикла;
		
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);

КонецПроцедуры

Процедура РассчитатьУдержания(Начисления)
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ЕстьNull(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза,0) КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Реквизит КАК Реквизит,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Результат КАК Результат,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
|			&Сотрудник,
|			&Сотрудник,
|			&Разрез,
|			Регистратор = &Ссылка
|				И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
|ГДЕ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");
	
	Разрез = Новый Массив;				
	Разрез .Добавить("ВидРасчета");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Разрез", Разрез);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	

	Пока Выборка.Следующий() Цикл 

				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);

				Движение.Результат = Выборка.РезультатБаза * 0.13; 

	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
|	ЕстьNull(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза,0) КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Реквизит КАК Реквизит
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
|			&Сотрудник,
|			&Сотрудник,
|			,
|			Регистратор = &Ссылка
|				И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыолненныеРаботыКлиентам)) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
|
|УПОРЯДОЧИТЬ ПО
|	НомерСтроки";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	


	Пока Выборка.Следующий() Цикл 

				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);

				Движение.Результат = Выборка.РезультатБаза * 0.13; 

	КонецЦикла;





	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ЕстьNull(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза,0) КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Реквизит КАК Реквизит,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Результат КАК Результат,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Сотрудник, &Сотрудник, &Разрез, Регистратор = &Ссылка И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
|ГДЕ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");
	
	Разрез = Новый Массив;				
	Разрез .Добавить("ВидРасчета");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Разрез", Разрез);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	

	Пока Выборка.Следующий() Цикл 

				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);

				Движение.Результат = Выборка.РезультатБаза * 0.13; 

	КонецЦикла; 
	
	Движения.ВКМ_Удержания.Записать(,Истина);	

КонецПроцедуры

Процедура ВзаиморасчетыССотрудниками() 
	
	
	 Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТ_основ
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТ_допол
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_Удержания.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТ_удерж
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Табл
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Табл.Сотрудник КАК Сотрудник,
		|	ЕстьNull(ВТ_основ.Результат,0) КАК РезультатОснов,
		|	ЕСТЬNULL(ВТ_допол.Результат, 0) КАК РезультатДопол,
		|	ЕстьNull(ВТ_удерж.Результат,0) КАК РезультатУдерж
		|ИЗ
		|	ВТ_Табл КАК ВТ_Табл
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_основ КАК ВТ_основ
		|		ПО (ВТ_Табл.Сотрудник = ВТ_основ.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_допол КАК ВТ_допол
		|		ПО (ВТ_Табл.Сотрудник = ВТ_допол.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_удерж КАК ВТ_удерж
		|		ПО (ВТ_Табл.Сотрудник = ВТ_удерж.Сотрудник)"	;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	
	Пока Выборка.Следующий() Цикл
				
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.РезультатОснов + Выборка.РезультатДопол - Выборка.РезультатУдерж; 
	
	КонецЦикла;
	
	 Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		

 КонецПроцедуры
 
 Процедура ДнейВОтпуске()
	
	//Движения по регистру ВКМ_отпуска
	Движения.ВКМ_Отпуска.Записывать = Истина;	

	Для Каждого Строка Из Начисления Цикл	
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
		Движение = Движения.ВКМ_Отпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДнейОтпуска = (Строка.ДатаКонец - Строка.ДатаНачала)/ 86400 + 1;
	    КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_Отпуска.Записать(); 	


КонецПроцедуры

#КонецОбласти
#КонецЕсли