#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
    СформироватьДвижения(); 
    
    РассчитатьОсновныеНачисления();
	
	РассчитатьДополнительныеНачисления();
	
	РассчитатьОтпуск();
	
    РассчитатьУдержания(Начисления);
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
	Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда

		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаКонец;
		Движение.ПериодРегистрации = Дата;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;  
		
		Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаНачала,-12));
		    Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаКонец,-1));
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда

	     Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		 Движение.Сторно = Ложь;
		 Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		 ДВижение.ПериодРегистрации = Дата;
		 ДВижение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		 
	КонецЕсли;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		
		Движение.ПериодРегистрации = Дата;
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления")Тогда 
			Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
			Движение.БазовыйПериодКонец = ТекСтрокаНачисления.ДатаКОнец;
		КонецЕсли;
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления")Тогда 
			Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		КонецЕсли;
		
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
	    Движение.Реквизит = ТекСтрокаНачисления.ВидРасчета;
	    
	КонецЦикла;

	
	Движения.ВКМ_ОсновныеНачисления.Записать();  
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	Движения.ВКМ_Удержания.Записать(); 
	
КонецПроцедуры 

Процедура РассчитатьОсновныеНачисления();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейПериодДействия КАК План,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник.Ссылка КАК СотрудникСсылка
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник.Ссылка = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Ссылка
		|ГДЕ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Получить(Выборка.НомерСтроки-1);
		Движение.Результат = Выборка.Оклад /Выборка.План * Выборка.Факт;
		Движение.РабочихДней = Выборка.Факт;
		
	КонецЦикла;  
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
		
КонецПроцедуры 

Процедура РассчитатьДополнительныеНачисления();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход,
		|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
		|			Сотрудник В
		|			(ВЫБРАТЬ
		|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|			ГДЕ
		|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Получить(Выборка.НомерСтроки-1);
		Движение.Результат = Выборка.СуммаКОплатеПриход;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(,Истина);

		
КонецПроцедуры

 Процедура РассчитатьОтпуск()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза1,
|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихДнейФактическийПериодДействия КАК Факт,
|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РабочихДнейБаза КАК РабочихДней
|ИЗ
|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
|				&Измерения,
|				&Измерения,
|				,
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
|				&Измерения,
|				&Измерения,
|				,
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
|				Регистратор = &Ссылка
|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
|		ПО (ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки)
|ГДЕ
|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Получить(Выборка.НомерСтроки-1);
		Движение.РабочихДней = Выборка.Факт; 
		Если Выборка.РабочихДней =0 Тогда
		Движение.Результат = 0 
		Иначе
		Движение.Результат = (Выборка.РезультатБаза + Выборка.РезультатБаза1)/Выборка.РабочихДней * Выборка.факт;	
		КОнецЕсли;
					
	КонецЦикла;
		
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);

КонецПроцедуры

Процедура РассчитатьУдержания(Начисления)
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Реквизит КАК Реквизит,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Результат КАК Результат,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
|			&Сотрудник,
|			&Сотрудник,
|			&Разрез,
|			Регистратор = &Ссылка
|				И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
|ГДЕ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");
	
	Разрез = Новый Массив;				
	Разрез .Добавить("ВидРасчета");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Разрез", Разрез);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	

	Пока Выборка.Следующий() Цикл 
//			Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыолненныеРаботыКлиентам Тогда
				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);
//				Движение.Результат = ТЗ.Найти(ТекСтрокаНачисления.НомерСтроки,"НомерСтроки").РезультатБаза * 0.13; 
				Движение.Результат = Выборка.РезультатБаза * 0.13; 
//			КонецЕсли;
	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Реквизит КАК Реквизит
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
|			&Сотрудник,
|			&Сотрудник,
|			,
|			Регистратор = &Ссылка
|				И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыолненныеРаботыКлиентам)) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
|
|УПОРЯДОЧИТЬ ПО
|	НомерСтроки";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
//	ТЗ = Запрос.Выполнить().Выгрузить();

	Пока Выборка.Следующий() Цикл 
//			Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыолненныеРаботыКлиентам Тогда
				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);
//				Движение.Результат = ТЗ.Найти(ТекСтрокаНачисления.НомерСтроки,"НомерСтроки").РезультатБаза * 0.13; 
				Движение.Результат = Выборка.РезультатБаза * 0.13; 
//			КонецЕсли;
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Реквизит КАК Реквизит,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Результат КАК Результат,
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Сотрудник, &Сотрудник, &Разрез, Регистратор = &Ссылка И Реквизит = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
|ГДЕ
|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)";
	Сотрудник = Новый Массив;				
	Сотрудник.Добавить("Сотрудник");
	
	Разрез = Новый Массив;				
	Разрез .Добавить("ВидРасчета");

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Разрез", Разрез);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	

	Пока Выборка.Следующий() Цикл 
//			Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыолненныеРаботыКлиентам Тогда
				Движение = Движения.ВКМ_Удержания.Получить(Выборка.НомерСтроки-1);
//				Движение.Результат = ТЗ.Найти(ТекСтрокаНачисления.НомерСтроки,"НомерСтроки").РезультатБаза * 0.13; 
				Движение.Результат = Выборка.РезультатБаза * 0.13; 
//			КонецЕсли;
	КонецЦикла; 
	
	Движения.ВКМ_Удержания.Записать(,Истина);	

КонецПроцедуры

















































#КонецОбласти
#КонецЕсли