Процедура ОтправитьСообщениевТелеграм() Экспорт
		 
		 Параметры1 = Новый Структура("АдресТелегарм,token,IdGroup");
		 Параметры1.АдресТелегарм = "api.telegram.org";  
		 Параметры1.token = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 							
		 Параметры1.IdGroup = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
		 СообщениеВТГ = "Тест";
		 
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщениеВТелеграмТестJSON(Параметры1,Выборка.ТекстСообщения);  
			КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
 
	//ОтправитьСообщениеВТелеграмТест(Параметры1,"Прверка");  
	//ОтправитьСообщениеВТелеграмТестJSON(Параметры1,"Проверкапавпав");  		 
		 
	 КонецПроцедуры
	 
	 //&НаСервере
	 //Процедура ОтправитьСообщениеВТелеграмТест(Параметры1,Сообщение) 
	 //    
	 //    Если ЗначениеЗаполнено(Сообщение) Тогда  
	 //   	 СтрокаПараметров = "chat_id="+Параметры1.IdGroup+"&parse_mode=html&text="+Сообщение;       
	 //   	 ВыполнитьHTTPЗапрос("GET",Параметры1.АдресТелегарм,"/bot"+Параметры1.token+"/sendMessage",СтрокаПараметров); 
	 //    КонецЕсли;	
	 //    
	 //КонецПроцедуры
	 //
	 //функция ВыполнитьHTTPЗапрос(Метод,АдресСайта,АдресРесурса,СтрокаПараметров)     
	 //    
	 //    HTTPЗапрос = Новый HTTPЗапрос;
	 //    HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	 //    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	 //    HTTPЗапрос.Заголовки.Вставить("POST");  
	 //    
	 //    Строка = 
	 //    
	 //    HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, "utf-8");
	 //    HTTPЗапрос.АдресРесурса = АдресРесурса;
	 //    
	 //    Попытка
	 //   	 Соединение1 = Новый HTTPСоединение(
	 //   	 АдресСайта, // сервер (хост)
	 //   	 443, // порт, по умолчанию для http используется 80, для https 443
	 //   	 , // пользователь для доступа к серверу (если он есть)
	 //   	 , // пароль для доступа к серверу (если он есть)
	 //   	 , // здесь указывается прокси, если он есть
	 //   	 30, // таймаут в секундах, 0 или пусто - не устанавливать
	 //   	 Новый ЗащищенноеСоединениеOpenSSL()
	 //   	 );
	 //   	 
	 //   	 ОтветHTTP = Соединение1.ОтправитьДляОбработки(HTTPЗапрос);
	 //   	 Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();	   
	 //    Исключение
	 //   	 Ответ = ОписаниеОшибки();	
	 //    КонецПопытки;
	 //    
	 //    Возврат Ответ; 	
	 //    
	 //КонецФункции 
	 &НаСервере
	 Процедура ОтправитьСообщениеВТелеграмТестJSON(Параметры1,Сообщение) 
		 
		 Если ЗначениеЗаполнено(Сообщение) Тогда  
		     //СтрокаПараметров = "chat_id="+Параметры1.IdGroup+"&parse_mode=html&text="+Сообщение; 
		    Структура = Новый Структура;
		    Структура.Вставить("chat_id",Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить()); 
		    Структура.Вставить("text",Сообщение);

		     
		    htym = СТруктура.text;
		     
		     ВыполнитьHTTPЗапросJSON("GET",Параметры1.АдресТелегарм,"/bot"+Параметры1.token+"/sendMessage",Структура); 
		 КонецЕсли;		 
			 
			 
			 
			 
			 
			 
			 
			 
			 
			 
			 
			 
			 
			 
		
		 
	 КонецПроцедуры
	 
	 функция ВыполнитьHTTPЗапросJSON(Метод,АдресСайта,АдресРесурса,СтрокаПараметров)     
		 
		 HTTPЗапрос = Новый HTTPЗапрос;  
		 HTTPЗапрос.Заголовки.Вставить("POST");
   		 HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		 
		 
		 
		 
		 ЗаписьJSON	= Новый ЗаписьJSON;
		 ЗаписьJSON.УстановитьСтроку();
		 ЗаписатьJSON(ЗаписьJSON,СтрокаПараметров,);
		 Строка = ЗаписьJSON.Закрыть();
		 
		 HTTPЗапрос.УстановитьТелоИзСтроки(Строка,"utf-8");
		 HTTPЗапрос.АдресРесурса = АдресРесурса;
		 
		 Попытка
			 Соединение1 = Новый HTTPСоединение(
			 АдресСайта, // сервер (хост)
			 443, // порт, по умолчанию для http используется 80, для https 443
			 , // пользователь для доступа к серверу (если он есть)
			 , // пароль для доступа к серверу (если он есть)
			 , // здесь указывается прокси, если он есть
			 30, // таймаут в секундах, 0 или пусто - не устанавливать
			 Новый ЗащищенноеСоединениеOpenSSL()
			 );
			 
			 ОтветHTTP = Соединение1.ОтправитьДляОбработки(HTTPЗапрос); 
			 
			 Если ОтветHTTP.КодСостояния = 200	Тогда
				 
				 Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();				 
				 Пока Выборка.Следующий() Цикл
					 
					 ОбъектСправочника = Выборка.ПолучитьОбъект();
					 ОбъектСправочника.Удалить();
					 
				 КонецЦикла; 

				 
				 Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();	
				 
			КонецЕсли;	 
				 
				 
				 
				 
				 
				 
				 
				 
		 Исключение
			 Ответ = ОписаниеОшибки();	
		 КонецПопытки;
		 
		 Возврат Ответ; 	
		 
	 КонецФункции
