#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщениевТелеграм() Экспорт
		 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	 |	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 ОтправитьСообщениеВТелеграмТестJSON(Выборка.ТекстСообщения,Выборка.Ссылка);  
	 КонецЦикла;
	 	 
КонецПроцедуры
	 
Процедура ОтправитьСообщениеВТелеграмТестJSON(Сообщение,СсылкаНаЭлементСправочника) 
		 
	 АдресТелегарм = "api.telegram.org";  
	 Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 							
	 ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

		 
	Если ЗначениеЗаполнено(Сообщение) Тогда  
		    Структура = Новый Структура;
		    Структура.Вставить("chat_id",ИдентификаторГруппы); 
		    Структура.Вставить("text",Сообщение);		     
		    ВыполнитьHTTPЗапросJSON("POST",АдресТелегарм,"/bot"+Токен+"/sendMessage",Структура,СсылкаНаЭлементСправочника); 
	КонецЕсли;	 
			 
КонецПроцедуры
	 
функция ВыполнитьHTTPЗапросJSON(Метод,АдресСайта,АдресРесурса,СтрокаПараметров,СсылкаНаЭлементСправочника)     
		 
		 HTTPЗапрос = Новый HTTPЗапрос;  
		 HTTPЗапрос.Заголовки.Вставить("POST");
   		 HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		 		 
		 ЗаписьJSON	= Новый ЗаписьJSON;
		 ЗаписьJSON.УстановитьСтроку();
		 ЗаписатьJSON(ЗаписьJSON,СтрокаПараметров,);
		 Строка = ЗаписьJSON.Закрыть();
		 
		 HTTPЗапрос.УстановитьТелоИзСтроки(Строка,"utf-8");
		 HTTPЗапрос.АдресРесурса = АдресРесурса;
		 
		 Соединение = Новый HTTPСоединение(
		 АдресСайта, // сервер (хост)
		 443, // порт, по умолчанию для http используется 80, для https 443
		 , // пользователь для доступа к серверу (если он есть)
		 , // пароль для доступа к серверу (если он есть)
		 , // здесь указывается прокси, если он есть
		 30, // таймаут в секундах, 0 или пусто - не устанавливать
		 Новый ЗащищенноеСоединениеOpenSSL()
		 );
		 
		 ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
		 
		 Если ОтветHTTP.КодСостояния = 200	Тогда
			 
			 ОбъектСправочника = СсылкаНаЭлементСправочника.ПолучитьОбъект();
			 ОбъектСправочника.Удалить();
			 
			 Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();	
			 
		 Иначе 
			 
			 Ответ = ОтветHTTP.ПолучитьТелоКакСтроку(); 
			 ЗаписьЖурналаРегистрации("Ошибка",,,,Ответ,);
			 
		 КонецЕсли;
		 
		 Возврат Ответ; 	
	
		 
КонецФункции
	 
#КонецОбласти
