#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Месяц = ТекущаяДатаСеанса();
	Объект.Период.ДатаНачала = НачалоМесяца(Месяц);
	Объект.Период.ДатаОкончания = КонецМесяца(Месяц);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	Объект.Период.ДатаНачала = НачалоМесяца(Месяц);
	Объект.Период.ДатаОкончания = КонецМесяца(Месяц);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ДействующиеАбонентскиеДоговора(Команда)
	
	Объект.АбонентскиеДоговора.Очистить();
	
	ДлительнаяОперация = ДействующиеАбонентскиеДоговораНаСервере(); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	 
	ПараметрыОжидания.Интервал = 1;
	
	ОповещениеОЗавершение = Новый ОписаниеОповещения("ОповещениеОЗавершение",ЭтотОбъект);  
	ДлительныеОперацииКЛиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершение,ПараметрыОжидания);
	
КонецПроцедуры



#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ДействующиеАбонентскиеДоговораНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьАвтозаполнениеМодМенеджера",Объект.Период); 
	
	Возврат ДлительнаяОперация;

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗаполнитьТаблЧасть(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьТаблЧасть(Массив) Экспорт 
	
	Если ЗначениеЗаполнено(Массив) Тогда
		
	Для СЧ = 1 ПО Массив[0].Количество() Цикл
		НоваяСтрока = Объект.АбонентскиеДоговора.Добавить(); 
		НоваяСтрока.АбонентскийДоговор = Массив[0][СЧ-1];
        НоваяСтрока.РеализацияТоваровИУслуг = Массив[1][СЧ-1];
	КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры 
  
#КонецОбласти